<template>
  <div class="tip-main">
    <h1 class="city-name">温馨提示</h1>
    <el-collapse v-model="activeNames" @change="handleChange">
      <el-collapse-item title="出行须知" name="1">
        <div>1、本产品报价是按照2成人入住1间房计算的价格，如出现单男单女，尽量安排该客人与其他同性别团友拼房；如不愿拼房或未能拼房，请补缴单房差。
          <br>2、本产品报价是按照2成人入住1间房计算的价格，不接受拼房，如出现单男单女请补缴单房差。
          <br>3、不含儿童餐费，若需要在酒店用餐，请您直接向酒店支付，敬请谅 解！
          <br>4、由于12岁以下儿童费用为不占床之报价，若儿童需占床，请补房差。
          <br>5、游客入住酒店后如需升级或者更换房型，需补交升级或者更换的房差费用。
          <br>6、当地购物时请慎重考虑，把握好质量与价格，务必索要发票。
          <br>7、按照国际惯例，酒店须在14：00后方能办理入住，在12：00之前办理退房手续。
          <br>8、本产品门票为团队优惠联票，持老人证，学生证等优惠证件的人群不再享受门票优惠。敬请谅 解！
          <br>9、出于环保考虑，所有酒店均不提供一次性卫生用品，请您自行携带好相关用品。
          <br>10、游泳、漂流、潜水等水上运动，均存在危险，参与前请根据自身条件，并充分参考当地海事部门及其它专业机构相关公告及建议后量力而行。
          <br>11、患有疾病的客人，参与此行程前请根据自身条件，请遵医嘱，安全第一，谨慎出行。
          <br>12、本产品不接受非大陆籍客人预订，敬请谅解！
          <br>13、北京气候干燥，外出请注意多喝水，避免长时间阳光照射，带好个人防晒用品。&nbsp; 6、如遇交通等不可抗力情况，导游会根据实际做出行程的调整，请游客知晓并理解。谢谢配合！&nbsp; 7、请不要迟到，以免耽误行程。若因个人原因迟到导致无法随车游览，责任自负，敬请谅解。
          <br>14、入住凭证：请携带本人有效身份证到酒店前台办理入住，最早到店时间：15:00，最晚离店时间：12:00。
          <br>15、因不可抗力、天气、罢工、或者以及轮船等一切非本社原因造成的甲方行程时间变更的，本社不承担责任
          <br>16、1、房间数量有限，为确保正常入住，请提前预约。请至少提前5~7天预约，节假日期间属于旅游旺季，请客人提前至少10天预约。如您指定的预约日期已经满房，建议您在有效期内更改其他日期入住或联系客服给您推荐同等级住宿。 2、使用有效期为：请在有效期内使用，过期无效；页面显示的日期为最后使用日期，具体入住日期请提前最少提前15天与客服确认！ 3、购买备注：下订单时请备注说明，姓名、身份证号、联系电话、入住日
          <br>17、5、入住时，请持入住本人身份证登记，一人一证；另外，需缴纳一定住房押金，退房时如无物品损坏或其它消费，押金将如数退还； 6、酒店房间只可入住2成人（仅含2成人早餐）。均需要带有效证件入住！ 7、入住时间：14:00后入住（如客人在10:00以后14:00以前到达酒店，可以先登记，把行李寄存）
          <br>18、由于旅游旺季预定人数较多 请预定前咨询客服查询位置后预定支付，如您未咨询直接预定，我们会给您查询位置，有位置录入消费码后合同生效。如没有位置我们会给您做退费处理，此合同自动作废。订单是否生效以最终通知为准。
          <br>19、【重要提示】 亲通过本店预订的酒店，我们只承诺是正规房间，酒店服务人员的服务质量以及酒店的其他设施新旧及配套服务，本店不做任何承诺，也不接受因为酒店服务人员或其他配套设施所产生的投诉，如介意，请勿购买。 由于此产品为特价用房，所有房款均提前全款打至酒店！故一经预约成功，不管因为个人什么原因（包括航班取消、火车取消、家中急事、身体不适等 任何理由）均无法退款或改期，还望亲谅解 并且慎重选择！
          <br>20、4.押金政策：入住酒店需要缴纳住房押金，押金金额以酒店为准，退房时如无物品损坏，无其他消费押金如数退还； 5.退房提醒：入住时请于预约当日14:00后入住酒店，于次日12:00之前办理退房，12点之后加收半日房费，18：00之后按全日房费计算。 6.早餐：7:00-9:00
          <br>21、1、本产品在您预订成交后， 如需退改或取消收取全部订单费用作为违约金，敬请您知晓与谅解 2、如订单支付成功后，酒店资源无法满足，我司将订单金额全额退还，给您带来不便敬请谅解 3、套餐内所含景点门票为赠送项目，如未消费视为自愿放弃，我司不退不换，敬请您知晓与谅解 4、如部分行程未履行，不能分开退款
          <br>22、游客到入住酒店凭有效证件办理入住手续，领取钥匙，换取旅游门票后即可开始旅程。 3.因游玩人数较多，建议周末尽早提前预订。 4.产品内容随淡旺季变化调整较为频繁，网页中的产品介绍、行程安排、价格构成等相关信息仅供参考所用； 5.本产品在您预订成交后，不退不换，敬请您知晓与谅解；
          <br>23、如遇人力不可抗拒因素（台风、暴雨、检修等）或政策性调整（博鳌亚洲论坛会议期间、全国性娱乐停演等）顺序做相应调整
          <br>24、请携带本人有效身份证件到前台办理入住，请于预约当日14:00后入住酒店，入住时请持本人有效身份证件进行登记，一人一证，于次日12:00之前办理退房，12点之后加收半日房费，18：00之后按全日房费计算。（仅供参考，具体以实际为准）
          <br>25、本产品预订后 不支持取消 变更日期等任何变动，如有任何变动费用不退。
          <br>26、每间房最多2名成人入住，1位1.2m（不含）以下儿童不占床位免费， 每日14:00之后入住，12:00之前退房，超时将加按照酒店收费标准收房费。
          <br>27、酒店分双人间/大床房两种，如您需要什么房型请在备注内注明，我们会尽量按照您的要求安排，但是不保证。（所有房型楼层均不保证）三人间多为双人间/大床房加床 不保证正规三人间。请谅解
          <br>28、酒店分为双人间/大床 入住房型我们会尽力安排 但是不保证
          <br>29、由于旅行社没有代售保险资质，请务必出行前自行购买人身意外保险
          <br>30、赠送项目如不参加费用不退，不分开退款
          <br>31、入住时需要缴纳押金，金额咨询前台，退房时如房间内无任何物品损坏，押金如数退还；
          <br>32、本产品不接收指定酒店，以实际安排为准，酒店安排的为标间或大床间，不保证床型，谢谢您的配合~
          <br>33、14点后持游玩人身份证原件（一人一证）到酒店前台报预订时预留的游玩人姓名办理入住，不可以变更
          <br>34、酒店对12周岁以下（不含12周岁）的儿童居住酒店客房不收取费用，前提是该儿童需要有成年人陪同
          <br>35、商家酒店房源有限、不承诺团购一定有房，请先咨询有房后再购买、避免无房或者预定支付后给您查看预约房间，如有房给您安排预约 无房您可以申请全额退款，感谢配合
          <br>36、本团购不做出有房保证，请预定前咨询位置 或者预定支付后给您查询位置，如有房直接给您发送出团通知，无法做全额退款处理或者给给您推荐其他有房套餐（多退少补）
          <br>37、法定节假日酒店不接受此套餐预订及入住 注：因酒店每个别墅房间数量有限，酒店根据预定时实际情况安排入住，不可指定别墅。
          <br>38、保证入住是15点。如果您早到，而且有房间就可以安排您入住。如果没有房间，您可以先享受酒店其他服务，前台会免费为您看管行李
          <br>39、不接受18岁以下客人单独入住
          <br>40、双人间/大床房尽力 但是不保证
          <br>41、滑雪为高风险活动 建议出行前自行购买人身意外保险，并量力而行，遵守景区滑雪规定。在规定滑道内慢速滑行。远离人群 看管好您的孩子 衣物等贵重物品，不要携带尖锐物品滑雪。以免发生危险。对于有高血压 心脏病以及做过四肢 颈部等不适合滑雪的手术以及疾病患者不建议滑雪。请对自身身体状况有充分认识。
          <br>42、法定假日 周末请联系客服补差价
          <br>43、由于旅行社没有代售保险资质，请务必出行前自行购买相关人身意外保险，本价格内容不含人身意外保险。
          <br>44、1、酒店旺季房源紧张，房间预定成功后，不可做任何取消及更改； 2、如订单支付成功后，酒店资源无法满足，我司将订单金额全额退还，给您带来不便敬请谅解！ 3、套餐内所含景点门票为赠送项目，如未消费视为自愿放弃，我司不退不换，敬请您知晓与谅解； 4、如部分行程未履行，不能分开退款
          <br>45、自由行产品除去单项门票以及活动项目 不含其他任何费用。
          <br>46、自由行产品预订后不支持变更日期 客人信息 以及取消等任何变动
          <br>47、根据身体状况 量力而行 不着急速度 注意安全
          <br>48、客人抵达目的地后请自行保管所有证件：如甲方发生证件遗失，乙方将给予配合：但因此产生本协议以外的费用（包括但不限于补办证件费、交通费、延住或者其他服务费用等）全部由甲方承担责任
          <br>49、请客人仔细阅读并详细了解全部条款内容，工作人员亦向客人对页面内容进行了详细说明后，如为代理人应对自身代理权的真实性和合法性承担责任，并承担将本协议内容转告未签名同行者的责任
          <br>50、1 涉及的相关产品订单由本单位合作的有资质的供应商提供服务。 2 本产品不含页面介绍外的任何费用
          <br>51、客人应遵守社会公共秩序和社会公德，遵守目的地国家或地区的法律法规、风俗习惯、文化传统和宗教信仰，爱护旅游资源，保护生态环境，遵守文明行为规范，不参与色情、赌博和涉毒等活动。若违反后果自负
          <br>52、提示客人购买人身意外保险，客人已知晓
        </div>
      </el-collapse-item>
    </el-collapse>
  </div>
</template>

<script>
export default {
  name: "TipMain",
  data() {
    return {
      activeNames: null
    };
  },
  methods: {
    handleChange(val) {
      console.log(val);
    }
  }
};
</script>

<style lang="less" scoped>
.tip-main {
  padding: 0.4rem 0.26667rem 0;
  background-color: #3c3c3c;
  .city-name {
    margin: 0.241546rem 0;
    font-size: 0.724638rem;
    position: relative;
    padding-left: 0.241546rem;
    color: aliceblue;
    &::before {
      content: "";
      width: 0.054155rem;
      height: 0.724638rem;
      background: #ffdb26;
      position: absolute;
      top: 0;
      left: 0;
    }
  }
  /deep/ .el-collapse {
      background-color: #3c3c3c50;
      
    .el-collapse-item__header {
      font-size: 0.483092rem;
      background-color: #3c3c3c;
      color: aliceblue;
    }
    .el-collapse-item__content {
        background-color: #3c3c3c;
        color: aliceblue;
    }
  }
}
</style>

